storage/Fluid_Data/rans/ConvDivChannel/Re12600_kOmega_100/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
        (0   0.0    -.1  )//0
        (12.56630039   0.0    -.1  )//1
        (12.56630039   1.3    -.1  )//2
        (0   1.3    -.1  )//3
        (0   0.0     .1  )//4
        (12.56630039   0.0     .1  )//5
        (12.56630039   1.3     .1  )//6
        (0   1.3     .1  )//7
        (12.56630039   2.0  -.1  )//8
        (0   2.0  -.1  )//9
        (0   2.0   .1  )//10
        (12.56630039   2.0   .1  )//11
);

blocks
(
        //hex (0 1 3 2 6 7 9 8) (40 25 30) simpleGrading (1 10.7028 1)
        hex (0 1 2 3 4 5 6 7)   (140 50 1) simpleGrading (1 10 1)
        hex (3 2 8 9 7 6 11 10) (140 50 1) simpleGrading (1 .1 1)
);


//EDGES-START
edges
(
spline 0 1 (
(0.0 0.0 -.1)
(0.00817935355 0.0 -.1)
(0.01635867916 0.0 -.1)
(0.02453809045 0.0 -.1)
(0.0327173695 0.0 -.1)
(0.04089676961 0.0 -.1)
(0.04907618091 0.0 -.1)
(0.05725545064 0.0 -.1)
(0.0654348582 0.0 -.1)
(0.07361414284 0.0 -.1)
(0.08179354668 0.0 -.1)
(0.08997295052 0.0 -.1)
(0.0981522277 0.0 -.1)
(0.1063316017 0.0 -.1)
(0.1145109013 0.0 -.1)
(0.1226902977 0.0 -.1)
(0.1308691949 0.0 -.1)
(0.1390486062 0.0 -.1)
(0.1472280025 0.0 -.1)
(0.1554073989 0.0 -.1)
(0.1635867953 0.0 -.1)
(0.1717662066 0.0 -.1)
(0.179945603 0.0 -.1)
(0.1881249994 0.0 -.1)
(0.1963045001 0.0 -.1)
(0.2044838965 0.0 -.1)
(0.2126632929 0.0 -.1)
(0.2208427042 0.0 -.1)
(0.2290221006 0.0 -.1)
(0.237201497 0.0 -.1)
(0.2453808933 0.0 -.1)
(0.2535603046 0.0 -.1)
(0.261739701 0.0 -.1)
(0.2699190974 0.0 -.1)
(0.2780984938 0.0 -.1)
(0.2862778902 0.0 -.1)
(0.2944572866 0.0 -.1)
(0.3026367128 0.0 -.1)
(0.3108161092 0.0 -.1)
(0.3189955056 0.0 -.1)
(0.327174902 0.0 -.1)
(0.3353531063 0.0 -.1)
(0.3435325027 0.0 -.1)
(0.351711899 0.0 -.1)
(0.3598912954 0.0 -.1)
(0.3680706918 0.0 -.1)
(0.3762500882 0.0 -.1)
(0.3844295144 0.0 -.1)
(0.3926089108 0.0 -.1)
(0.4007883072 0.0 -.1)
(0.4089677036 0.0 -.1)
(0.4171471 0.0 -.1)
(0.4253264964 0.0 -.1)
(0.4335058928 0.0 -.1)
(0.4416852891 0.0 -.1)
(0.4498646855 0.0 -.1)
(0.4580441117 0.0 -.1)
(0.4662235975 0.0 -.1)
(0.4744029939 0.0 -.1)
(0.4825823903 0.0 -.1)
(0.4907617867 0.0 -.1)
(0.4989412129 0.0 -.1)
(0.5071204901 0.0 -.1)
(0.5152999759 0.0 -.1)
(0.5234794021 0.0 -.1)
(0.5316588283 0.0 -.1)
(0.5398381948 0.0 -.1)
(0.548017621 0.0 -.1)
(0.5561969876 0.0 -.1)
(0.5643764138 0.0 -.1)
(0.5725545287 0.0 -.1)
(0.5807340145 0.0 -.1)
(0.5889133811 0.0 -.1)
(0.5970926881 0.0 -.1)
(0.6052721739 0.0 -.1)
(0.6134516001 0.0 -.1)
(0.6216310263 0.0 -.1)
(0.6298103929 0.0 -.1)
(0.637989819 0.0 -.1)
(0.6461691856 0.0 -.1)
(0.6543486118 0.0 -.1)
(0.6625279784 0.0 -.1)
(0.6707074046 0.0 -.1)
(0.6788867712 0.0 -.1)
(0.6870661974 0.0 -.1)
(0.6952456236 0.0 -.1)
(0.7034249902 0.0 -.1)
(0.7116044164 0.0 -.1)
(0.719783783 0.0 -.1)
(0.7279620171 0.0 -.1)
(0.7361413836 0.0 -.1)
(0.7443208098 0.0 -.1)
(0.7525001764 0.0 -.1)
(0.7606796026 0.0 -.1)
(0.7688590288 0.0 -.1)
(0.7770383954 0.0 -.1)
(0.7852178216 0.0 -.1)
(0.7933971882 0.0 -.1)
(0.8015766144 0.0 -.1)
(0.809755981 0.0 -.1)
...
)
spline 4 5 (
(0.0 0.0 .1)
(0.00817935355 0.0 .1)
(0.01635867916 0.0 .1)
(0.02453809045 0.0 .1)
(0.0327173695 0.0 .1)
(0.04089676961 0.0 .1)
(0.04907618091 0.0 .1)
(0.05725545064 0.0 .1)
(0.0654348582 0.0 .1)
(0.07361414284 0.0 .1)
(0.08179354668 0.0 .1)
(0.08997295052 0.0 .1)
(0.0981522277 0.0 .1)
(0.1063316017 0.0 .1)
(0.1145109013 0.0 .1)
(0.1226902977 0.0 .1)
(0.1308691949 0.0 .1)
(0.1390486062 0.0 .1)
(0.1472280025 0.0 .1)
(0.1554073989 0.0 .1)
(0.1635867953 0.0 .1)
(0.1717662066 0.0 .1)
(0.179945603 0.0 .1)
(0.1881249994 0.0 .1)
(0.1963045001 0.0 .1)
(0.2044838965 0.0 .1)
(0.2126632929 0.0 .1)
(0.2208427042 0.0 .1)
(0.2290221006 0.0 .1)
(0.237201497 0.0 .1)
(0.2453808933 0.0 .1)
(0.2535603046 0.0 .1)
(0.261739701 0.0 .1)
(0.2699190974 0.0 .1)
(0.2780984938 0.0 .1)
(0.2862778902 0.0 .1)
(0.2944572866 0.0 .1)
(0.3026367128 0.0 .1)
(0.3108161092 0.0 .1)
(0.3189955056 0.0 .1)
(0.327174902 0.0 .1)
(0.3353531063 0.0 .1)
(0.3435325027 0.0 .1)
(0.351711899 0.0 .1)
(0.3598912954 0.0 .1)
(0.3680706918 0.0 .1)
(0.3762500882 0.0 .1)
(0.3844295144 0.0 .1)
(0.3926089108 0.0 .1)
(0.4007883072 0.0 .1)
(0.4089677036 0.0 .1)
(0.4171471 0.0 .1)
(0.4253264964 0.0 .1)
(0.4335058928 0.0 .1)
(0.4416852891 0.0 .1)
(0.4498646855 0.0 .1)
(0.4580441117 0.0 .1)
(0.4662235975 0.0 .1)
(0.4744029939 0.0 .1)
(0.4825823903 0.0 .1)
(0.4907617867 0.0 .1)
(0.4989412129 0.0 .1)
(0.5071204901 0.0 .1)
(0.5152999759 0.0 .1)
(0.5234794021 0.0 .1)
(0.5316588283 0.0 .1)
(0.5398381948 0.0 .1)
(0.548017621 0.0 .1)
(0.5561969876 0.0 .1)
(0.5643764138 0.0 .1)
(0.5725545287 0.0 .1)
(0.5807340145 0.0 .1)
(0.5889133811 0.0 .1)
(0.5970926881 0.0 .1)
(0.6052721739 0.0 .1)
(0.6134516001 0.0 .1)
(0.6216310263 0.0 .1)
(0.6298103929 0.0 .1)
(0.637989819 0.0 .1)
(0.6461691856 0.0 .1)
(0.6543486118 0.0 .1)
(0.6625279784 0.0 .1)
(0.6707074046 0.0 .1)
(0.6788867712 0.0 .1)
(0.6870661974 0.0 .1)
(0.6952456236 0.0 .1)
(0.7034249902 0.0 .1)
(0.7116044164 0.0 .1)
(0.719783783 0.0 .1)
(0.7279620171 0.0 .1)
(0.7361413836 0.0 .1)
(0.7443208098 0.0 .1)
(0.7525001764 0.0 .1)
(0.7606796026 0.0 .1)
(0.7688590288 0.0 .1)
(0.7770383954 0.0 .1)
(0.7852178216 0.0 .1)
(0.7933971882 0.0 .1)
(0.8015766144 0.0 .1)
(0.809755981 0.0 .1)
...
);
//EDGES-END
//EDGES-END
//EDGES-END


boundary
(
    bottomWall
    {
        type            wall;
        faces           ((4 0 1 5));
    }
    
    topWall
    {
        type            wall;
        faces           ((10 11 8 9));
    }

    inlet
    {
        type            patch;
        faces
	(
	 (7 3 0 4)
	 (7 10 9 3)
	);
    }

    outlet
    {
        type            patch;
        faces
	(
	 (6 5 1 2)
	 (11 6 2 8)
	);
    }

    frontAndBack
    {
        type            empty;
        faces
	(
	 (6 7 4 5)
	 (10 7 6 11)
	 (0 3 2 1)
	 (3 9 8 2)
	);
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
