storage/Fluid_Data/rans/ConvDivChannel/Re12600_kOmega_100/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.11; 

boundaryField
{
    bottomWall
    {
        type            omegaWallFunction;
        value           uniform 1000;
    }
    topWall
    {
        type            omegaWallFunction;
        value           uniform 1000;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
583.965251838681
115.159654259225
51.6027638390594
30.3504034493333
20.3600755648328
14.8602871939585
11.4750703365155
9.21660851048044
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
